ArtMoney Plugin
8.17
Přeložil:
Peter Urbášek
peter.urbasek@gmail.com
O programu
Game Cheater
<d> <ms>, <yyyy>//formát data
Copyright (C) 1996-2020, System SoftLab
Najdeš-li nějaké chyby nebo
máš-li připomínky, emailuj mi sem
Poslední verze je na Artmoney sajtě.
Hodnota
Hledat
Upřesnit
Počet hodnot
Nejdříve vyber proces
Teď začni hledat v procesu
Upřesni nalezená čísla, dokud se počet nesníží
Promiň, ale nenašel jsi nic. Zkus to znovu.
Vypnout
Nalezeno
čísla
čísla
číslo
V tabulce 
Chyba při čtení
Chyba při hledání
Chyba při upřesňování
Formát souboru není podporován
Chybné zadání čísla
Nelze načíst
Proces hledání
Proces upřesňování
všechny možné
byte
byte
bytů
Chybná metoda. Zkus nějakou jinou.
sek
min
Pro tuto metodu jsi nezadal typ
Velikost typu nesmí být větší, než
Změněn
Nezměněn
Zvýšen
Snížen
Tato tabulka byla vytvořena novější verzí
Tato tabulka je poškozena
Chyba přístupu k souboru
Celé číslo 1 byte
Celé číslo 2 byty
Celé číslo 3 byty
Celé číslo 4 byty
Celé číslo 8 bytů
Plovoucí 4 byty
Plovoucí 6 bytů
Plovoucí 8 bytů
Plovoucí 10 bytů
Text
Nulou ukončený řetězec
Nulový řetězec
Pascalův řetězec
R.Celé číslo 2 byty//R.=Reverse = zpět
R.Celé číslo 3 byty
R.Celé číslo 4 byty
R.Celé číslo 8 bytů
R.Plovoucí 4 byty
R.Plovoucí 6 bytů
R.Plovoucí 8 bytů
R.Plovoucí 10 bytů
R.Text
R.Nulový řetězec
R.Pascalův řetězec
Leden
Únor
Březen
Duben
Květen
Červen
Červenec
Srpen
Září
Říjen
Listopad
Prosinec
F//F=Freeze - Zmrazení
Nápověda
O programu
Vyber proces
Vymazat
Otevřít
Uložit
Přidat
Přidat vše
Upravit
Kopírovat
Smazat
Zmrazit
Odmrazit
Autopoužít offset 
Info
Typ hry
Čas mrazení (ms)
Obnovovací čas (ms)
Jazyk
Zobrazit adres
HotKlávesa
Hlavní
Rozšiřující
Osobní
Email
Standardní komentář
Operační systém
Decimální formát
Pořadí bytů
Priorita procházení
Vysoká
Plná
Možnosti
Storno
Normální
Upravit adresu
Zmrazit
Velikost
Adresa
Popis
Typ 
Opačné
Přesná hodnota
Pořadí hodnot
Rozsah hodnot
Neznámá hodnota
Kódovaná hodnota
Vlastní
Vyber typ
Pořadí bytů
Normální a opačný
Vše
Celé číslo
Plovoucí
Čas od startu :
Čas ukončení :
Rychlost :
Nalezeno :
Hra
Komentář
Datum
Systém
Tabulka informací
Vytvořil
Jméno
Lokace
Pořadí vstupů
Nastavit hotklávesu
Opačně
Hledat v tomto bloku paměti
Hledat v rozsahu adres
Šetřit místo na disku
od
do
Hledat
Upřesnit
Krok
Krok//nastavit hodnotu
Nastavit hodnotu
Vybrat vše
AUTO
Zobrazit procesy
Viditelné
S windows
Informace o procesu
Ukončit proces
Ukázat okno
Skrýt okno
Jsi si jistý, že chceš ukončit tento proces ?
Přístup odepřen
Proces nelze ukončit
Název souboru
Typ procesu
Velikost dat
Benchmark
Benchmark pro měření rychlosti prohledávání paměti
Čekej
Tvůj systém
Speciální HotKlávesy
Přidat k hodnotě
Uzamknout toto okno
"Zpět/Vpřed upřesňování" je povoleno
Zobrazit celé číslo
Bez znaménka
Se znaménkem
Zpět upřesňování
Vpřed upřesňování
Uložit upřesňování
Otevřít upřesňování
Tento krok je
"Zpět upřesňování" není povoleno
"Vpřed upřesňování" není povoleno
"Otevřít upřesňování" není povoleno
zvýšil o
snížil o
Rozhraní
Hotklávesy
Hotklávesy zapnuty
Hotklávesy výchozí
Hlavní písmo
Tabulkové písmo
Hlavní barva pozadí
Barva pozadí u zadávání
Barva tlačítek
Elipsovité tlačítko
OK
Úpravy paměti
Hexadecimální prohlížení
Hexadecimální upravování
Číslo hodnoty sloupce
Pohled buňky
Aktuální buňka
Pohyb
Pohyb ve výsledcích hledání
Pohyb v tabulce
Pohyb v bloku paměti
Pohyb na adresu
První
Předchozí
Další
Poslední
Celkem
Aktuální
Zkopírovat oblast
Vložit oblast
Přidat do tabulky
Vše (standard)
Celé číslo (standard)
Plovoucí (standard)
Převrátit výběr
Rozložení sloupců
<NIC>
Ukazatel
Obnovit
Úprava vybrána
Skupina
Viditelná skupina
Vyber skupinu
Uložit tuto adresu/ukazatel
Autopoužít offset na vše
Autopoužít offset na skupinu
Autopoužít offset ukládané adresy na vše
Autopoužít offset ukládané adresy na skupinu
Příkazy s ukazately
Nastavit ukazatel všem
Nastavit ukazatel skupině
Nastavit ukazatel všem
Nastavit ukazatel skupině
Nastavit ukazatele této adrese
Nastavit ukazatele ukládané adrese
Hledat ukazatel k této adrese
Hledat ukazatel začátku paměťového bloku
Setřídit
Setřídit dle popisu
Setřídit dle adresy
Setřídit dle hodnoty
Setřídit dle hodnoty jako textu
Setřídit dle skupiny
Připojit
Chyba připojení
Obě tabulky musí vytvořit jeden autor
Vybrat aktuální proces
Znaková sada
Zobrazit panel viditelné skupiny
Ve skupině
Převést ukazatele na adresy
Nastavit filtr
Řetězec
<Soubor nenalezen>
<Přístup zakázán>
Souborový editor
Chyby
<Velikost se změnila>
Vzhled
Žádný vzhled
Upravit písmo
Barva tabulky
Uložit obtisk paměti
Podle vzorce
Procesy
Zastavit proces
Pokračovat v procesu
Uložit proces
Nahrát proces
ID procesu
Vlákna
Soubor(y)
Informace o souboru(ech)
Vyber soubor
Vyber adresář
Číslo souboru
Velikost celkem
Pohyb v adresáři
Objekt
Tabulka
Konec
Výsledek
Více
Kup si "ArtMoney Pro" online
Navštiv domácí stránky
ArtMoney manuál
Kódování
Výběr kódování
Jas
Sytost
Zobrazit hlavní menu
Použít neoficiální jazykové pluginy
Během hledání zastavit proces
Uložit/nahrát hodnoty v souboru tabulky
Knihovna pro prohlížeč procesu
Možnosti adresáře
Maska názvu souboru
Čas úpravy
Datum souboru
Čas souboru
Bez kontroly
Posl. 15 min
Posl. hodinu
Posl. den
Posl. měsíc
Posl. rok
Více než
Méně než
Tato funkce je dostupná jen v ArtMoney Pro
jen v ArtMoney Pro
Licenční ujednání
Souhlasím s termíny a podmínkami Licenčního ujednání
O verzi PRO
Speciální díky
za design uživatelského manuálu
za logo
za modul nastavení
za vytvoření ikony
za kontrolu pravopisu v angickém manuálu
za nápovědu
za vzhled engine (package ThemeEngine)
za rady a užitečné poznámky
za překlad
za tabulky
Registrační číslo
Neregistrováno
Víckrát se už na heslo neptat
Jen pro aktuálního uživatele Windows
Zastavit proces a popup okno
Přepnout a pokračovat v procesu
Uzavřít přebytečnou závorku
Uzavřít potřebnou závorku
Uzavření přebytečných uvozovek
Špatné ID
Špatný počet argumentů (M1,M2...)
Špatný počet operací (-,+)
Špatný počet podmínek (<,>,=)
Špatný počet výrazů
Špatný výraz
Tento krok neexistuje
Špatná podmínka
Špatný parametr pro
Žádné podmínky
Hledání
Registrace
Heslo
Prosím, vlož heslo a stiskni "OK"
Špatné heslo
Špatný či starý soubor s klíčem
Žádný soubor s klíčem
Výchozí
Zrušeno uživatelem
Jazyk manuálu
Proces nenalezen či zakázán přístup
Obnovit hodnoty v tabulce pouze pomocí fokusu formuláře
Velikost kódu
Mapa procesu
Adresa regionu
Stav
Ochrana regionu
Ochrana
Název modulu
Tohle funguje jen ve Windows 2000/XP/2003/VISTA/2008/7/8/2012/10
Ukládání/Nahrávání procesu
Mód
Špatný proces. Proces se změnil nebo restartoval.
Zavřít
V Excelu
Zaokrouhlit hodnoty plovoucích čísel
Macromedia Flash
Rozsah
Ponechat proces v paměti
Rezervovaná velikost fyzické paměti
Spustit nový proces
Instalovat
Vytvořit zástupce na plochu
Skrýt proces
Zobrazit proces
Emulátor
Herní systém
Rozsah adresy
Použít volby emulátoru
Mapa paměti emulátoru
Emul.adresa
PC adresa
Chceš převést adresy emulátoru na PC?
Chceš převést adresy PC na emulátor?
Chyba při převodu adres
Autozjištění emulátoru dle názvu souboru
Skupiny
Zobrazit strom skupin
Nic
Vlevo
Vpravo
Nová skupina
Hlavní
Jazyk
Chceš smazat tento jazyk?
Chceš přidat nový jazyk?
Chceš přejmenovat název jazyka?
normální zmrazení
lze zvyšovat
lze snižovat
z minima na maximum
Minimum
Maximum
Kopie vybrána
Stáhnout program "Spyware Process Detector"
Program "Spyware Process Detector" ve tvém počítači nebyl nalezen. Stáhnout a nainstalovat jej můžeš ze stránek naší společnosti www.systemsoftlab.com. Program může pracovat spolu s ArtMoney jako výběr procesu. Použitím programu "Spyware Process Detector" můžeš otevřít jakýkoli skrytý proces a proces, který blokuje otvírání. Program zobrazí detailní informace o procesech běžících ve tvém PC a detekuje nové (nezjistitelné tvým antivirovým skenerem) spywary, trojany a viry.
Zašli doporučení či hlášení o chybách do
Navštiv stránky naší společnosti a stáhni si další programy
Toto je LIMITOVANÁ verze zdarma. Plnou verzi si můžete koupit jen za 399 korun českých. Jen jedna platba - a nové verze jsou zdarma!
Pouze registrovaní uživatelé obdrží plnou technickou podporu a můžou využívat všechny extra výhody.
Pro zakoupení se ujisti, že jsi připojen k internetu a klikni na tlačítko Registrovat Online nyní dole.
Registrovat Online nyní
Instalace služby
Windows potřebuje ověřit uživatele pro instalaci skužby.
Instalovat jako následující uživatel
Jméno uživatele
Doména
Chyba instalace služby. Přístup zamítnut.
Přihlášení uživatele neúspěšné
Maskovaný mód
Skrýt můj proces
Skrýt má okna
Je nainstalována starší verze služby. Prosím, restartuj tvůj počítač pro instalaci novější verze.
Tabulka se změnila
Chceš uložit změny?
Dotaz k uložení tabulky s neuloženými změnami při ukončení programu
Struktura
Přeskočeno
Pole
Velikost struktury nesmí být větší, než
Položka
Nová položka
Hledat strukturu tabulky
Hledat strukturu skupiny
Hledat strukturu zvolených adres
Posun nahoru
Posun dolů
Získat "ArtMoney Pro" zdarma
za kontrolu pravopisu v ruském manuálu
Typ zaokrouhlení
Na nejbližší
Dolů
Nahoru
Směrem k nule
Pokračovat
Získej ho zdarma
Disassembler
Instrukce Assembleru
Adresování modulu
Modul
Adresa v modulu
Chyba převodu
Nemůžu převést adresu modulu: Takový modul v procesu není.
Skenovat oblast paměti systénových modulů
Skenovat oblast paměti sdílených modulů
Chyba při otvírání procesu
Tento proces nelze otevřít.
Zkus použít verzi PRO.
Pro tuto tabulku potřebuješ verzi PRO
Neplatný registr
Neplatná adresa
Neplatná hodnota
Hodnota je moc velká
Neplatná instrukce assembleru
Spusť ArtMoney jako Administrátor. Klikni pravým tlačítkem na ikonu aplikace a zvol Administrátor z menu "Spustit jako...".
Chyba spouštění služby
Chyba otvírání služby
Zkus restartovat tvé PC
změnilo se o
Převod tabulky
Chceš převést tvou tabulku do 64-bitového módu?
Chceš převést tvou tabulku do 32-bitového módu?
Chyba při převodu. Program nemůže převést adresy do 32-bitového módu.
Násobnost adresy//Dělitelnost adresy
Sudé//Dělitelné 2
Liché
Násobek 4//Dělitelné 4
Násobek 8//Dělitelné 8
Násobek 16//Dělitelné 16
Skenovat v modulech jen statické adresy
Zobrazit volby modulu
Vložit registrační kód
Prosím, vlož ze schránky  tvůj registrační kód (použij Ctrl-V nebo tlačítko "Vložit") a klikni na "OK"
Vložit
Registrační kód je neplatný
Registrační kód je vhodný jen pro anglickou verzi
Registrační kód je vhodný jen pro ruskou verzi
Registrační kód je vhodný jen pro starou verzi
Registrační kód už nefunguje. Prosím, kontaktuj sales@systemsoftlab.com pro tvůj nový registrační kód
Pokud zde nevidíš tvé jméno a tvé údaje, pak používáš cracknutou či ukradenou verzi, a tato verze nebude správně fungovat!
Ukazatel na Ukazatel
Maximální offset
Úroveň z
Hledat ukazatel na Ukazatel
Maximální úroveň 2 pro SE vydání!
Zkus vypnout Vynucení podpisu ovladače
Rychlý režim (využívá více paměti)
Mb
Auto-použít offset a kopírovat do nové skupiny
Adresa v bloku
Nemůžu převést na Adresu v bloku: Žádný takový blok v procesu.
Problém při převodu: Velikost bloku není jednoznačná.
Setřídit ukazatele dle offsetu
Skrýt text pro plný utajený režim//VIP
Koupit či prodat účty online hry
Je dostupná nová verze ke stažení
Zkontrolovat novou verzi
Ukazatel s offsetem
Najít ukazatel s max dostupným offsetem
dostupné z kroku 2
Vzorec
Verze
Vždy nahoře
Zapnout "Vždy nahoře"
Vypnout "Vždy nahoře"
Zkontroluj si připojení na internet! Nelze otevřít systemsoftlab.com
Zkus nastavit volby
Jméno/Modul
Hexadecimální Kód
Registr
Příznak
Připojit ladicí program
Odpojit ladicí program
Chcete připojit ladicí program k vybranému procesu?
Seznam bodů přerušení
Příkazy
Ladit
Uložit informace o ladění
Načíst informace o ladění
Jazyk symbolických adres
x86-32 bitů
x86-64 bitů
Přerušení
Přidat přerušení
Odebrat přerušení
Spustit
Spustit do
Do návratu
Krokování
Přeskočit krokování
Nastavit název adresy
Odstranit název adresy
Ano
Ne
Typ ladicího programu
Standardní
Zpracování výjimek
Typ přerušení při spuštění
Softwarové (int3 instrukce)
int3
Ladící registry (max. 4)
registr
Výjimky stránky
výjimky
Typ přerušení při přístupu
Zeptat se při pokusu o připojení ladicího programu k procesu
Použít softw. body přerušení pokud jsou použity všechny ladící registry
Automaticky Uložit/Načíst ladící informace
Použít ladící symboly
Umístění symbolů
Aktivní
Přerušení
Spuštění
Přístup
Zápis
Podmínky
Změny
Povolit vše
Zakázat vše
Najít instrukci, která přistupuje k adrese
Při přístupu do paměti
Při zápisu do paměti
Chyba podmínek
Chyba změn
Dělení nulou
Chyba čtení
Chyba zápisu
Špatná levá strana
Start
Stop
Přístup
Smazat výsledek
Rozdělit po vláknech
Číslo
Vlákno
8-bitů
16-bitů
32-bitů
Hexa//Hexadecimal maxsize 11
Hexa//Hexadecimal short maxsize 5
Plovoucí4
Plovoucí8
Hexadecimální sekvence
server systemsoflab.com nereaguje nebo není k dispozici připojení k internetu
Registrační kód je zablokován
Tento kód můžete aktivovat pouze 2krát denně
Registrační kód je platný pouze pro VIP edici
Skrýt přítomnost debuggeru
Uložit tabulku v unicode
Získat velikost do konce funkce (do návratu)
Licence
Skenovat paměťové oblasti
zapisovatelné pro data
data pouze pro čtení
zapisovatelné pro kód
kód pouze pro čtení
sdílené
systémové
chráněné
skryté
Násobnost každé adresy
Seznam názvů adres a symbolů
Symboly složek
Uživatelská jména
Rozeznává velká a malá písmena
Celá slova
První pozice
Čtení/Zápis
Automaticky zjistit velikost funkcí
Skrýt registry ladění
Upravit tyto funkce (struktury)
Obejít ochranu procesu
Použít vlastní funkce pro přístup do paměti
Funkce uživatelského režimu (připojit k procesu)
Funkce režimu jádra (prostřednictvím ovladače)
Připojit se k procesu bez použití OpenProcess
Podpisy
Hledat podpis
Přidat podpis
Offset
Automatické vyhledávání
Statická adresa
Regiony
Upravit jako jazyk symbolických adres
Jako jazyk symbolických adres
Převést na HEXA
Omezit jedinečné offsety na úroveň
Nahrazování kódu
Nahradit kód
Nahradit veškerý kód současně
<NAHRAZENO>
<NENAHRAZENO>
<ŽÁDNÝ MODUL>
<ŽÁDNÝ BLOK>
<ŽÁDNÝ PODPIS>
<ŽÁDNÁ PROMĚNNÁ>
Vložení kódu
Vložit kód
Pouze po úspěšném nahrazení kódu
Automaticky nahradit a vložit všechen kód
Povolit automatické nahrazení a vložení veškerého kódu
Žádat o povolení k automatické výměně a vložení veškerého kódu
Tabulka obsahuje kód pro vkládání a výměnu. Může to být škodlivý kód! Stahujte tabulky pouze z velmi důvěryhodných webů! Chcete vložit kód do procesu?
Nahradit a vložit všechen kód
Zrušit výměnu a vkládání kódu
Podpis
Původní Podpis
Špatný původní podpis
Adresa podpisu//plná
Adresa podpisu//krátká
Adresa proměnné/label//plná
Adresa proměnné//krátká
Nemohu převést adresu podpisu: Žádný takový podpis.
Nelze převést adresu proměnné: Žádná taková proměnná.
Název//variable or label
Velikost kódu pro výměnu
Jedna instrukce assembleru
Několik instrukcí assembleru
Řádek
Chyba relativního adresování (offset je příliš velký)
Neplatný násobič
Chyba zpětného skoku
Nelze přidělit paměť
Oblasti//Memory areas
Nastavit zrcadlovou adresu
Smazat zrcadlovou adresu
od minimální adresy
Služba
Zobrazit offset ukazatelů v hexadecimálním formátu
Použijte registr RAX (EAX). Pouze MOV instrukce s registrem RAX (EAX) může číst/zapisovat absolutní adresu!
Změnit rychlost procesu
Vaše rychlost (%)
Normalní//Speed
Chyba změny rychlosti procesu
Zvýšit rychlost procesu
Snížit rychlost procesu
Zásobník
Zobrazit jako zásobník
Uložit zásobník vlákna
Návratová adresa
Parametr
Parametry
Zobrazit parametry v jednom řádku
Adresa návratu pouze v modulu
Chyba čtení paměti
Digits after a decimal point (Fractional part)//full
Digits a.//short
Masks
Read mask
Write mask
Use mask type
<MASK ERROR>
Server sent an invalid response or bad internet connection
stacks
Use stack of the threads as module name
Limit the number of threads
Stack of thread
64-bit stack of thread
Temp files folder
Current user folder
Program folder
Another folder
Temp folder error
Temp folder does not exist and could not be created
Last digits
D60BFABC